In [4]:
import pandas as pd
# pandas is a python module that makes data science easy and efficitive by mananging data in dataframe(table format)

In [7]:
#pandas dataframes
"Data frame is the main object in pandas. It is used to represent data with rows and columns. Data frame is a data structure represent the data in tablular or excel spread sheet like data)"

#creating a dataframe
df=pd.read_csv("weather_data.csv")
df

# or
#weather_data=[('1/2/23',32,6,'rain'...)]
#df=pd.DataFrame(weather_data,columns=['date','temp','windspeed','event'])

        date  temperature  windspeed   event
0  1/2/2023'           32          6   rain'
1  2/2/2023'           34          8   rain'
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow
5  6/2/2023'           42          6  sunny'
6  7/2/2023'           38          2    snow

In [8]:
df.shape #totals no. of rows and columns

(7, 4)

In [9]:
df.head() #show initial some rows default 5 rows

        date  temperature  windspeed   event
0  1/2/2023'           32          6   rain'
1  2/2/2023'           34          8   rain'
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow

In [10]:
df.tail() #show last few rows default 5 rows

        date  temperature  windspeed   event
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow
5  6/2/2023'           42          6  sunny'
6  7/2/2023'           38          2    snow

In [11]:
df[2:5] #slicing

        date  temperature  windspeed   event
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow

In [12]:
df.columns

Index(['date', 'temperature', 'windspeed', 'event'], dtype='object')

In [13]:
df['date']

0    1/2/2023'
1    2/2/2023'
2    3/2/2023'
3    4/2/2023'
4    5/2/2023'
5    6/2/2023'
6    7/2/2023'
Name: date, dtype: object

In [14]:
df['temperature'].max()

42

In [15]:
df['temperature'].describe()

count     7.000000
mean     34.142857
std       4.775932
min      28.000000
25%      31.000000
50%      34.000000
75%      36.500000
max      42.000000
Name: temperature, dtype: float64

In [17]:
#select rows which hass max temp
df[df.temperature==df.temperature.max()]

        date  temperature  windspeed   event
5  6/2/2023'           42          6  sunny'

In [20]:
#select only date column which has max temp
df.date[df.temperature==df.temperature.max()]

5    6/2/2023'
Name: date, dtype: object

In [25]:
#to read and write excel file

In [24]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\gaura\anaconda\lib\site-packages (2.0.1)Note: you may need to restart the kernel to use updated packages.

In [26]:
df=pd.read_excel("weather_data.xlsx")

In [27]:
df

        date  temperature  windspeed   event
0  1/2/2023'           32          6   rain'
1  2/2/2023'           34          8   rain'
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow
5  6/2/2023'           42          6  sunny'
6  7/2/2023'           38          2    snow

In [28]:
df.to_csv('new.csv')

In [30]:
new=pd.read_csv('new.csv')
new

# to remove index df.to_csv('new_noIndex.csv',index=False)

   Unnamed: 0       date  temperature  windspeed   event
0           0  1/2/2023'           32          6   rain'
1           1  2/2/2023'           34          8   rain'
2           2  3/2/2023'           28          3   rain'
3           3  4/2/2023'           30          4  sunny'
4           4  5/2/2023'           35          5    snow
5           5  6/2/2023'           42          6  sunny'
6           6  7/2/2023'           38          2    snow

In [32]:
# to write df to excel

In [31]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\gaura\anaconda\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\gaura\anaconda\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [33]:
df.to_excel('new1.xlsx',sheet_name='weather_data')

In [39]:
# Group-By
print(df)
g=df.groupby('date')
print(g)

        date  temperature  windspeed   event
0  1/2/2023'           32          6   rain'
1  2/2/2023'           34          8   rain'
2  3/2/2023'           28          3   rain'
3  4/2/2023'           30          4  sunny'
4  5/2/2023'           35          5    snow
5  6/2/2023'           42          6  sunny'
6  7/2/2023'           38          2    snow
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020E291D7A30>

In [44]:
#concate data frames
us_weather=pd.DataFrame({"city":['new york',"chicago"],
                        'temp':[23,43]})
india_weather=pd.DataFrame({"city":['dwarka',"bawana"],
                        'temp':[34,42]})
datafr=pd.concat([india_weather,us_weather])
datafr

       city  temp
0    dwarka    34
1    bawana    42
0  new york    23
1   chicago    43

In [46]:
# to make index normal
df=pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temp
0    dwarka    34
1    bawana    42
2  new york    23
3   chicago    43

In [47]:
df=pd.concat([india_weather,us_weather], axis=1)
df

     city  temp      city  temp
0  dwarka    34  new york    23
1  bawana    42   chicago    43

In [50]:
#merges df is like join in database
#df=pd.merge(df,datafr,on='city') inner join
#df=pd.merge(df,datafr,on='city',how='outer')

In [52]:
datafr

       city  temp
0    dwarka    34
1    bawana    42
0  new york    23
1   chicago    43

In [54]:
df=pd.DataFrame([1,2,3,4,5,6],index=[45,76,7,6,4,3])
df

    0
45  1
76  2
7   3
6   4
4   5
3   6

In [56]:
df.loc[:4] #till index find to be 4

    0
45  1
76  2
7   3
6   4
4   5

In [59]:
df.iloc[:4] # till row 4

    0
45  1
76  2
7   3
6   4